title: Possible WEBDAV Attack
status: produção
author: A.W. Networksecure Segurança da Informação LTDA.
date: 2023/08/24
description: This rule triger when in URL was seen extensions used in webshells as asp, aspx, php, exe 
references:
  - https://vk9-sec.com/exploiting-webdav/
tags:
  - webdav
  - attack.T1187
logsource:
  category: Alert
  product:
    - waf
    - IPS
    - IDS
detection:
  selection:
    httpMethod: 
      - WEBDAV
      - PUT
    url: 
      - cfm
      - cgi
      - jsp
      - php
      - asp
      - aspx
      - html
      - shtml
      - jhml
      - pl
  condition: 
fields:
  - httpMethod
  - url
falsepositives:
  - admin_local.bat
  - TCE_Zimbra.bat
  - list_admin_local.bat
  - bginfo.vbs
  - bginfo.exe
level: medium
